


MIP6 Working Group                                          Hee-Jin Jang
Internet-Draft                                               Alper Yegin
Intended status: Standards Track                                 SAMSUNG
Expires: July 24, 2008                                  Kuntal Chowdhury
                                                        Starent Networks
                                                          JinHyeock Choi
                                                                 SAMSUNG
                                                        January 21, 2008


          DHCP Option for Home Information Discovery in MIPv6
                      draft-ietf-mip6-hiopt-10.txt

Status of this Memo

   By submitting this Internet-Draft, each author represents that any
   applicable patent or other IPR claims of which he or she is aware
   have been or will be disclosed, and any of which he or she becomes
   aware will be disclosed, in accordance with Section 6 of BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups.  Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at
   http://www.ietf.org/ietf/1id-abstracts.txt.

   The list of Internet-Draft Shadow Directories can be accessed at
   http://www.ietf.org/shadow.html.

   This Internet-Draft will expire on July 24, 2008.

Copyright Notice

   Copyright (C) The IETF Trust (2008).










Jang, et al.              Expires July 24, 2008                 [Page 1]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


Abstract

   This draft defines a DHCP-based scheme to enable dynamic discovery of
   Mobile IPv6 home network information.  New DHCP options are defined
   which allow a mobile node to request the home agent IP address, FQDN,
   or home network prefix and obtain it via the DHCP response.


Table of Contents

   1.  Introduction . . . . . . . . . . . . . . . . . . . . . . . . .  3
   2.  Terminology  . . . . . . . . . . . . . . . . . . . . . . . . .  4
   3.  DHCP options for HA Dynamic Discovery  . . . . . . . . . . . .  5
     3.1.  Home Network Identifier Option . . . . . . . . . . . . . .  5
     3.2.  MIP6 Relay Agent Option  . . . . . . . . . . . . . . . . .  7
       3.2.1.  MIP6 Relay Agent Sub-option  . . . . . . . . . . . . .  7
     3.3.  Home Network Information Option  . . . . . . . . . . . . .  8
       3.3.1.  Home Network Information Sub-option  . . . . . . . . .  9
   4.  Option Usage . . . . . . . . . . . . . . . . . . . . . . . . . 12
     4.1.  Mobile Node Behavior . . . . . . . . . . . . . . . . . . . 12
     4.2.  NAS/DHCP Relay Agent Behavior  . . . . . . . . . . . . . . 13
     4.3.  DHCP Server Behavior . . . . . . . . . . . . . . . . . . . 14
   5.  Security Considerations  . . . . . . . . . . . . . . . . . . . 16
   6.  IANA Consideration . . . . . . . . . . . . . . . . . . . . . . 17
   7.  Acknowledgements . . . . . . . . . . . . . . . . . . . . . . . 18
   8.  References . . . . . . . . . . . . . . . . . . . . . . . . . . 19
     8.1.  Normative References . . . . . . . . . . . . . . . . . . . 19
     8.2.  Informative References . . . . . . . . . . . . . . . . . . 19
   Authors' Addresses . . . . . . . . . . . . . . . . . . . . . . . . 20
   Intellectual Property and Copyright Statements . . . . . . . . . . 21





















Jang, et al.              Expires July 24, 2008                 [Page 2]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


1.  Introduction

   Before a mobile node can engage in Mobile IPv6 signaling with a home
   agent, it should either know the IP address of the home agent via
   pre-configuration, or dynamically discover it.  Mobile IPv6
   specification [RFC3775] describes how home agents can be dynamically
   discovered by mobile nodes that know the home network prefix.  This
   scheme does not work when prefix information is not already available
   to the mobile node.  This problem can be solved by delivering one or
   more home network prefix information to the mobile node by means of
   DHCP.  Subsequently, the mobile node can engage in dynamic home agent
   discovery using the prefix information.  In addition to delivering
   the prefix information, DHCP can also be used to provide the IP
   addresses or FQDNs of the home agents that are available to the
   mobile node.  The solution involves defining new DHCP options to
   carry home network prefix, home agent IP address and FQDN
   information.

   As part of configuring the initial TCP/IP parameters, a mobile node
   can find itself a suitable home agent.  Such a home agent might
   reside in the access network that the mobile node connects to, or in
   a home network that the mobile node is associated with.  A mobile
   node can indicate its home network identity when roaming to the
   visited network in order to obtain the MIP6 bootstrap parameters from
   the home network.  As an example, the visited network may determine
   the home network of the mobile node based on the realm portion of the
   NAI (Network Access Identifier) used in access authentication.

   The mobile node may or may not be connected to the "home" network
   when it attempts to learn Mobile IPv6 home network information.  This
   allows operators to centrally deploy home agents while being able to
   bootstrap mobile nodes that are already roaming.  This scenario also
   occurs when HMIPv6 [RFC4140] is used, where the mobile node is
   required to discover the MAP (a special home agent) that is located
   multiple hops away from the mobile node's attachment point.
















Jang, et al.              Expires July 24, 2008                 [Page 3]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


2.  Terminology

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in [RFC2119].

   General mobility terminology can be found in [RFC3753].  The
   following additional terms, as defined in [RFC4640], are used in this
   document:

   Access Service Provider (ASP): A network operator that provides
   direct IP packet forwarding to and from the mobile node.

   Mobility Service Provider (MSP): A service provider that provides
   Mobile IPv6 service.  In order to obtain such service, the mobile
   node must be authenticated and authorized to obtain the Mobile IPv6
   service.

   Mobility Service Authorizer (MSA): A service provider that authorizes
   Mobile IPv6 service.































Jang, et al.              Expires July 24, 2008                 [Page 4]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


3.  DHCP options for HA Dynamic Discovery

   This section introduces new DHCP options used for dynamic home agent,
   FQDN, or home prefix information discovery in Mobile IPv6.  The
   drafts [I-D.ietf-mip6-radius] and
   [I-D.ietf-mip6-bootstrapping-integrated-dhc] describe the complete
   procedure for home agent assignment among the mobile node, NAS, DHCP,
   and AAA entities for bootstrapping procedure in the integrated
   scenario.

   The NAS and the DHCP relay agent are assumed to be collocated in this
   solution.  In the network where the NAS is not collocated with the
   DHCP relay agent, the DHCP server will provide the home information
   which has been preconfigured by the administrator or which is
   acquired through the mechanism that is not described in this
   document.

3.1.  Home Network Identifier Option

   This option is included in the Information-request message and used
   to indicate the target home network requested by the mobile node to
   the DHCP server.





























Jang, et al.              Expires July 24, 2008                 [Page 5]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6_HNID        |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     id-type   |   sequence #  |                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+                               +
   .                                                               .
   .                    Home Network Identifier                    .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

            OPTION_MIP6_HNID (TBD)

         option-len

            2 + length of Home Network Identifier field

         id-type

            The type of Home Network Identifier:

                0    Visited domain (local ASP)

                1    Target MSP

                2    No preference

         sequence #

            An 8-bit unsigned integer used by the mobile node
            to match a returned the Home Network Information option
            with the corresponding Home Network Identifier option.

         Home Network Identifier

            The identifier to specify the requested home network of
            the mobile node. This field MUST be set in the form of
            FQDN [RFC1035], encoded as specified in Section 8 of
            [RFC3315].

   The id-type 0 indicates the mobile node is interested in learning the
   home network information that pertains to the currently visited
   network.  This type can be used to discover local home agents in the
   local ASP.  In this case, the option-len field is set to 2 and the
   Home Network Identifier field MUST not be included.




Jang, et al.              Expires July 24, 2008                 [Page 6]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   The id-type 1 indicates the mobile node is interested in learning the
   home network information that pertains to the given realm.  This type
   can be used to discover home agents that are hosted by a user's home
   domain or by any target domain.  The requested domain is specified in
   the Home Network Identifier field and can be a mobile node's home MSP
   or any MSP which has trust roaming relationship with the mobile
   node's MSA.

   If the mobile node has no preference, the id-type is set to 2.  The
   option-len field is set to 2 and the Home Network Identifier field
   MUST not be included.  In this case, the assignment of the home
   network information is within the server's own discretion.  For the
   detailed processing, refer to Section 4.

3.2.  MIP6 Relay Agent Option

   This option carries the home network information for the mobile node
   (the NAS may know this, for instance, through AAA by using
   [I-D.ietf-mip6-radius]).  The DHCP relay agent sends this option to
   the DHCP server in the Relay-Forward message.


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6_RELAY       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   .                          sub-options                          .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

            OPTION_MIP6_RELAY (TBD).

         option-len

            The length of sub-options

         sub-options

            A series of MIP6 Relay Agent sub-options.


3.2.1.  MIP6 Relay Agent Sub-option

   This sub-option carries the assigned home network information to the
   DHCP server.




Jang, et al.              Expires July 24, 2008                 [Page 7]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          sub-opt-code         |        sub-opt-len            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   .                     Home Network Information                  .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

            A 16-bit unsigned integer for the type of the following
            Home Network Information field. Possible values are:

                1    Home network prefix

                2    Home agent address

                3    Home agent FQDN

         sub-opt-len

            The length of Home Network Information field.

         Home Network Information

            A home network prefix, home agent IP address or home agent
            FQDN to be provided to a mobile node according to the
            sub-opt-code. These are encoded as specified in Section
            3.2.1.

   When the sub-opt-code is set to 1, the Home Network Information field
   MUST contain the 8-bit prefix length information followed by the 128-
   bit field for the available home network prefix.

   When the sub-opt-code is set to 2, the Home Network Information field
   MUST contain the 128-bit IPv6 address of the home agent.

   When the sub-opt-code is set to 3, the Home Network Information field
   MUST contain the FQDN as described in Section 8 of [RFC3315].

   Multiple sub-options may exist in a MIP6 Relay Agent option to carry
   more than one home information.

3.3.  Home Network Information Option

   This option is included in the Reply message and used to carry home
   network information to the mobile node in the form of one or more of



Jang, et al.              Expires July 24, 2008                 [Page 8]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   home network prefix(es), home agent address(es) and home agent
   FQDN(s).


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |       OPTION_MIP6_HNINF       |           option-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   sequence #  |                                               |
   +-+-+-+-+-+-+-+-+                                               +
   .                          sub-options                          .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         option-code

            OPTION_MIP6_HNINF (TBD).

         option-len

            1 + length of sub-options

         sequence #

            This field is copied from the sequence number field in
            the received Home Network Identifier option. It is used
            by the mobile node for matching the Home Network
            Information option with the corresponding Home Network
            Identifier option.

         sub-options

            A series of Home Network Information sub-options.

3.3.1.  Home Network Information Sub-option

   This sub-option carries the assigned home network information to the
   DHCP client.













Jang, et al.              Expires July 24, 2008                 [Page 9]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |          sub-opt-code         |          sub-opt-len          |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |V|  reserved   |                                               |
   +-+-+-+-+-+-+-+-+                                               +
   .                     Home Network Information                  .
   .                                                               .
   .                                                               .
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

         sub-opt-code

            A 16-bit unsigned integer for the type of the following
            Home Network Information field. Possible values are:

                1    Home network prefix

                2    Home agent address

                3    Home agent FQDN

         sub-opt-len

            1 + length of Home Network Information field.

         V flag

            This flag specifies the location of home network where
            the home agent is assigned. If it is set to 1, it means
            that the following Home Network Information is allocated
            from the visited network. Otherwise, it means that the
            Home Network Information is allocated from the target
            MSP specified in the Home Network Identifier option.

         reserved

            A 7-bit field reserved for future use. The value MUST
            be initialized to 0 by the sender and MUST be ignored by
            the receiver.

         Home Network Information

            A home network prefix, home agent IP address or home agent
            FQDN to be provided to a mobile node according to the
            sub-opt-code.





Jang, et al.              Expires July 24, 2008                [Page 10]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   The sub-opt-code, sub-opt-len and Home Network Information fields are
   set in the same manner as those of a MIP6 Relay Agent sub-option.

   Multiple sub-options may exist in a Home Network Information option
   to carry more than one home information.

   The detailed processing for each id-type is described in Section 4.












































Jang, et al.              Expires July 24, 2008                [Page 11]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


4.  Option Usage

   The requesting and sending of the proposed DHCP options follow the
   rules for DHCP options in [RFC3315].

4.1.  Mobile Node Behavior

   The mobile node does not need to perform the home information
   discovery procedure after its every movement.  It may try to perform
   the home network information discovery when it lacks home network
   information for MIPv6 or needs to change the home agent for some
   reasons, for instance, to recover from the single point of failure of
   the existing home agent or to use the topologically best home agent.
   Note that despite the home information discovery procedure the mobile
   node may decide to keep the old home agent still in use after in
   order to avoid losing the current sessions.

   In order to acquire the home network information, the mobile node
   SHALL send an Information-request to the
   All_DHCP_Relay_Agents_and_Servers multicast address.  In this message
   the mobile node (DHCP client) SHALL include the Option Code for the
   Home Network Information option in the OPTION_ORO.

   During the process of requesting the bootstrapping information, the
   mobile node MUST clarify its preference about the requested home
   network with the id-type in the Home Network Identifier option.  Even
   though the mobile node does not care about the location of the home
   network where the home agent to be assigned, it MUST clarify the fact
   by setting the id-type to 2.

   The mobile node can request more than one home information by using
   multiple Home Network Identifier options in the request.  For
   instance, if the mobile node wants to retrieve home network
   information from both the visited network (ASP) and the target MSP
   with a single transaction, it can request the information by using
   two Home Network Identifier options with the id-type 0 and the id-
   type 1.  It can also request the home information for more than one
   target MSPs at the same time by including multiple Home Network
   Identifier options with the id-type 1.  However, there should not be
   more than one Home Network Identifier option with the id-type 0 nor
   more than one Home Network Identifier option with the id-type 2 in
   the request.

   The Reply message can carry multiple Home Network Information
   options.  A single Home Network Information option also can contain
   multiple Home Network Information sub-options.

   When provided with more than one home network information, the mobile



Jang, et al.              Expires July 24, 2008                [Page 12]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   node is required to have a selection mechanism to determine which one
   to use for establishing a Mobile IPv6 session.  For example, if the
   mobile node acquires both IPv6 address and FQDN of the home agent, it
   may try to use the address information of the home agent first.

   The mobile node matches the returned Home Network Information options
   with the corresponding Home Network Identifier options based on
   sequence numbers in the options.  Sequence numbers provide the way to
   match options when the mobile node has requested with the multiple
   Home Network Identifier options with the same id-type 1 but with the
   different Home Network Identifiers.

   When the mobile node has requested the home network information with
   the id-type 0 or 1 but cannot be provided with the proper
   information, that is, option-len = 1 in the Home Network Information
   option, then it may request again by setting the id-type to 2 in the
   Home Network Identifier option.

   In case the Home Network Information option carries the sub-option
   whose 'V' flag is not consistent with the id-type, the mobile node
   SHOULD ignore and skip the sub-option.

4.2.  NAS/DHCP Relay Agent Behavior

   As described in Section 3, the NAS and the DHCP relay agent are
   assumed to be collocated.  The NAS communicates with the mobile node
   during the network access authentication and interacts with the AAAH
   (via the AAAV) using either Diameter NASREQ [RFC4005] or RADIUS
   [I-D.ietf-mip6-radius] [Editor's note: The Diameter AVPs need to be
   defined].  When receiving the MIP6 related RADIUS or Diameter
   attributes returned by the AAAH, the NAS passes the information to
   the collocated DHCP relay agent.

   Upon receiving the Information-request from the mobile node, the DHCP
   relay agent SHALL forward the message to the DHCP server as per
   [RFC3315].  The relay agent SHALL use the OPTION_CLIENTID to identify
   the mobile node.  This is required to check whether there is some
   additional information for the user that needs to be appended while
   relaying the Information-request message to the DHCP server.  If the
   relay agent determines that the NAS has passed home network
   information for this mobile node and has available home information
   for it, the relay agent MUST include the home network information in
   the MIP6 Relay Agent option, and attach this option in the Relay-
   forward message.

   The mobile node may send an Information-request with the Home Network
   Identifier option just after network access authentication or long
   after network access authentication when it decides to run MIPv6 by



Jang, et al.              Expires July 24, 2008                [Page 13]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   using bootstrapping mechanism.  So the NAS is required to store the
   home information for the mobile node which is attached into itself so
   that it can provide the information at the time of receiving the
   Information-request from the mobile node.

   In case the relay agent does not maintain any home network
   information for the requesting mobile node, it simply forward the
   received message to the DHCP server according to the [RFC3315].

   Upon receiving a Relay-reply message from the DHCPv6 server, the
   relay agent SHALL follow the guidelines defined in [RFC3315].  The
   relay agent extracts the Information-request message from the Relay
   Message option in the Relay-reply message and relays it to the mobile
   node.

4.3.  DHCP Server Behavior

   When the mobile node receives the Information-request message with
   the Home Network Identifier option in the Relay-forward message, it
   checks the Information-request message includes the Home Network
   Identifier option, MIP6 Relay Agent option and the Option Code for
   the Home Network Information option in the OPTION_ORO.  The
   Information-request message may not include the MIP6 Relay Agent
   option in case there was no home information available to the mobile
   node at the NAS.

   The DHCP server MUST follow the following logic to construct a Reply
   message with the Home Network Information option, and include the
   Reply message in the payload of a Relay Message option of Relay-reply
   message.

   Information Request message includes:

   A. Home Network Identifier option with the id-type 0

   The DHCP server MUST include the configured local home information in
   the Home Network Information option, and set all of the V flags in
   its sub-options to 1s.  The information may have been pre-configured
   statically in the server.  In this case, the MIP6 Relay Agent option
   in the Information-request is not used.

   B. Home Network Identifier option with the id-type 1

   The Home Network Identifier option which does not carry any target
   MSP MUST be ignored.  If the DHCP server has the corresponding
   information for the target MSP, it MUST include the information in
   the Home Network Information option, and set all of the V flags in
   its sub-options to 0s.  The server can provide the matching



Jang, et al.              Expires July 24, 2008                [Page 14]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


   information extracted from the MIP6 Relay Agent option or from the
   information preconfigured locally according to the policy.

   C. Home Network Identifier option with the id-type 2

   In this case, the assignment of the home information relies on the
   server's local policy, and the DHCP server is required to have its
   own policy so that it can reply with the proper information in the
   Home Network Information option.  The policy can be determined based
   on several factors such as the home agent availability and the
   authorization information of the mobile node.  However, the specific
   policy setting is not in the scope of this document.  The V flag in
   each sub-option is set to 0 or 1 according to the type of provided
   home network information.

   The DHCP server should provide all of the matching home information
   in Home Network Information option(s) based on its policy.  There can
   be several ways that a DHCP server learns mechanism to know or
   retrieve the requested home network information.  For instance, as
   described in [I-D.ietf-mip6-radius], the NAS can learn the
   information via RADIUS during network access authentication, and NAS-
   collocated DHCP relay can transfer it to the DHCP server by using the
   proposed DHCP option in this document.  Or the home information may
   have been configured statically in the DHCP server by the
   administrator.  However, the mechanism by which the DHCP server is
   provisioned with the home network information or obtains it
   dynamically is outside the scope of this document.

   The Reply message can carry multiple Home Network Information
   options.  However, note that there SHOULD not be more than one Home
   Network Information option with the id-type 0 nor more than one Home
   Network Information option with the id-type 2 in the reply.  When the
   server has more than one home network information to provide for a
   single Home Network Identifier option, it SHOULD include each of them
   in a Home Network Information sub-option and include all sub-options
   in a single Home Network Information option.

   In case that the server cannot find any home information for a
   specific id-type, it MUST return the Home Network Information option
   by setting the id-type to the requested id-type and the option-len to
   1.










Jang, et al.              Expires July 24, 2008                [Page 15]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


5.  Security Considerations

   Secure delivery of home agent and home network information from a
   DHCP server to the mobile node (DHCP client) relies on the same
   security as DHCP.  The particular option defined in this draft does
   not have additional impact on DHCP security.

   Aside from the DHCP client to server interaction, an operator must
   also ensure secure delivery of mobile IP information to the DHCP
   server.  This is outside the scope of DHCP and the newly defined
   option.








































Jang, et al.              Expires July 24, 2008                [Page 16]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


6.  IANA Consideration

   This document defines new DHCPv6 options, and IANA is requested to
   assign the following new DHCPv6 Option Codes/Sub-option Codes in the
   registry maintained in
   http://www.iana.org/assignments/dhcpv6-parameters:

       o OPTION_MIP6_HNID for the Home Network Identifier option
       o OPTION_MIP6_RELAY for the MIP6 Relay Agent option
       o OPTION_MIP6_HNINF for the Home Network Information option

   The Sub-option Codes for both OPTION_MIP6_RELAY and OPTION_MIP6_HNINF
   options:

       o Home network prefix     1
       o Home agent address      2
       o Home agent FQDN         3

   These Sub-option Codes should be placed in a new name space "DHCPv6
   Mobile IPv6 Sub-option Codes" under the same registry.  Future values
   can be allocated via Standards Action or IESG Approval.

   In addition, a new name space "Home Network Identifier Option id-type
   Values" should be created, again in the same registry.  Values 0, 1,
   and 2 are assigned by this document as specified in Section 3.1.
   Future values can be allocated via Standards Action or IESG Approval.

























Jang, et al.              Expires July 24, 2008                [Page 17]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


7.  Acknowledgements

   The authors would like to thank Kilian Weniger, Domagoj Premec,
   Basavaraj Patil, Vijay Devarapalli, Gerardo Giaretta, Bernie Volz,
   David W. Hankins, Behcet Sarikaya, Vidya Narayanan and Miguel A. Diaz
   for their valuable feedbacks.













































Jang, et al.              Expires July 24, 2008                [Page 18]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


8.  References

8.1.  Normative References

   [I-D.ietf-mip6-bootstrapping-integrated-dhc]
              Chowdhury, K. and A. Yegin, "MIP6-bootstrapping for the
              Integrated Scenario",
              draft-ietf-mip6-bootstrapping-integrated-dhc-05 (work in
              progress), July 2007.

   [I-D.ietf-mip6-radius]
              Chowdhury, K., "RADIUS Mobile IPv6 Support",
              draft-ietf-mip6-radius-03 (work in progress),
              November 2007.

   [RFC1035]  Mockapetris, P., "Domain names - implementation and
              specification", STD 13, RFC 1035, November 1987.

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119, March 1997.

   [RFC3315]  Droms, R., Bound, J., Volz, B., Lemon, T., Perkins, C.,
              and M. Carney, "Dynamic Host Configuration Protocol for
              IPv6 (DHCPv6)", RFC 3315, July 2003.

   [RFC3775]  Johnson, D., Perkins, C., and J. Arkko, "Mobility Support
              in IPv6", RFC 3775, June 2004.

   [RFC4005]  Calhoun, P., Zorn, G., Spence, D., and D. Mitton,
              "Diameter Network Access Server Application", RFC 4005,
              August 2005.

   [RFC4282]  Aboba, B., Beadles, M., Arkko, J., and P. Eronen, "The
              Network Access Identifier", RFC 4282, December 2005.

8.2.  Informative References

   [RFC3753]  Manner, J. and M. Kojo, "Mobility Related Terminology",
              RFC 3753, June 2004.

   [RFC4140]  Soliman, H., Castelluccia, C., El Malki, K., and L.
              Bellier, "Hierarchical Mobile IPv6 Mobility Management
              (HMIPv6)", RFC 4140, August 2005.

   [RFC4640]  Patel, A. and G. Giaretta, "Problem Statement for
              bootstrapping Mobile IPv6 (MIPv6)", RFC 4640,
              September 2006.




Jang, et al.              Expires July 24, 2008                [Page 19]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


Authors' Addresses

   Hee-Jin Jang
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: heejin.jang@samsung.com


   Alper E. Yegin
   Samsung Electronics
   Istanbul
   Turkey

   Email: a.yegin@partner.samsung.com


   Kuntal Chowdhury
   Starent Networks
   30 International Place
   Tewksbury, MA  01876
   US

   Email: kchowdhury@starentnetworks.com


   JinHyeock Choi
   Samsung Advanced Institute of Technology
   P.O. Box 111
   Suwon 440-600
   Korea

   Email: jinchoe@samsung.com
















Jang, et al.              Expires July 24, 2008                [Page 20]

Internet-Draft   DHCPv6 for Home Info Discovery in MIPv6    January 2008


Full Copyright Statement

   Copyright (C) The IETF Trust (2008).

   This document is subject to the rights, licenses and restrictions
   contained in BCP 78, and except as set forth therein, the authors
   retain all their rights.

   This document and the information contained herein are provided on an
   "AS IS" basis and THE CONTRIBUTOR, THE ORGANIZATION HE/SHE REPRESENTS
   OR IS SPONSORED BY (IF ANY), THE INTERNET SOCIETY, THE IETF TRUST AND
   THE INTERNET ENGINEERING TASK FORCE DISCLAIM ALL WARRANTIES, EXPRESS
   OR IMPLIED, INCLUDING BUT NOT LIMITED TO ANY WARRANTY THAT THE USE OF
   THE INFORMATION HEREIN WILL NOT INFRINGE ANY RIGHTS OR ANY IMPLIED
   WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.


Intellectual Property

   The IETF takes no position regarding the validity or scope of any
   Intellectual Property Rights or other rights that might be claimed to
   pertain to the implementation or use of the technology described in
   this document or the extent to which any license under such rights
   might or might not be available; nor does it represent that it has
   made any independent effort to identify any such rights.  Information
   on the procedures with respect to rights in RFC documents can be
   found in BCP 78 and BCP 79.

   Copies of IPR disclosures made to the IETF Secretariat and any
   assurances of licenses to be made available, or the result of an
   attempt made to obtain a general license or permission for the use of
   such proprietary rights by implementers or users of this
   specification can be obtained from the IETF on-line IPR repository at
   http://www.ietf.org/ipr.

   The IETF invites any interested party to bring to its attention any
   copyrights, patents or patent applications, or other proprietary
   rights that may cover technology that may be required to implement
   this standard.  Please address the information to the IETF at
   ietf-ipr@ietf.org.


Acknowledgment

   Funding for the RFC Editor function is provided by the IETF
   Administrative Support Activity (IASA).





Jang, et al.              Expires July 24, 2008                [Page 21]


